ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/Номенклатура/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

&Вместо("ИспользованиеЭлементов")
Функция бг_ИспользованиеЭлементов(ПереданныйОбъект, РежимВидимостиПоказатьТолькоВажные, РежимПроверкиИспользованияРеквизитов)
	
	Результат = ПродолжитьВызов(ПереданныйОбъект, РежимВидимостиПоказатьТолькоВажные, РежимПроверкиИспользованияРеквизитов);
	
	ВидНоменклатуры = Неопределено;
	
	Если ТипЗнч(ПереданныйОбъект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидНоменклатуры = ПереданныйОбъект.ВидНоменклатуры;
	ИначеЕсли ТипЗнч(ПереданныйОбъект.Ссылка) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда  	
		ВидНоменклатуры = ПереданныйОбъект.Ссылка;
	КонецЕсли; 
	
	Если ВидНоменклатуры = бг_КонстантыПовтИсп.ЗначениеКонстанты("ФедеральнаяСпецМарка") Тогда
		
		Результат.ВидАлкогольнойПродукции = Истина;
		Результат.ОбъемДАЛ                = Истина;
		Результат.Крепость                = Истина;
		
		Если Не РежимПроверкиИспользованияРеквизитов Тогда	
			Результат.ДекорацияДекалитры = Результат.ОбъемДАЛ;
			Результат.ДекорацияПроцентыКрепости = Результат.ВидАлкогольнойПродукции;
		КонецЕсли;
		
	КонецЕсли; 	
	
	Возврат Результат;
	
КонецФункции

Функция бг_ЧастиНаименования() Экспорт
	
	ЧастиНаименования = Новый Массив;
	
	ЧастиНаименования.Добавить("бг_ОсновноеНаименование");
	ЧастиНаименования.Добавить("бг_Вариативность");
	ЧастиНаименования.Добавить("бг_ГодУрожая");
	ЧастиНаименования.Добавить("Крепость");
	ЧастиНаименования.Добавить("ВидНоменклатуры");	
	
	Возврат ЧастиНаименования;
	
КонецФункции

Функция бг_НаименованиеИзЧастей(ОбъектИлиЗначенияЧастей) Экспорт
		
	бг_НеФормироватьНаименованиеПоШаблону = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
												ОбъектИлиЗначенияЧастей.ВидНоменклатуры,
												"бг_НеФормироватьНаименованиеПоШаблону"); 
	
	Если бг_НеФормироватьНаименованиеПоШаблону Тогда 
		
		Наименование = ОбъектИлиЗначенияЧастей.бг_ОсновноеНаименование;
		
	Иначе		
		
		Если ЗначениеЗаполнено(ОбъектИлиЗначенияЧастей.бг_ОсновноеНаименование)
			И ЗначениеЗаполнено(ОбъектИлиЗначенияЧастей.бг_Вариативность) Тогда
			
			ЧастиНаименования = Новый Массив;
			ЧастиНаименования.Добавить(ОбъектИлиЗначенияЧастей.бг_ОсновноеНаименование);
			ЧастиНаименования.Добавить(ОбъектИлиЗначенияЧастей.бг_Вариативность);
			
			Наименования = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЧастиНаименования, "Наименование");
			
			ОсновноеНаименование = Наименования.Получить(ОбъектИлиЗначенияЧастей.бг_ОсновноеНаименование);
			Вариативность = Наименования.Получить(ОбъектИлиЗначенияЧастей.бг_Вариативность);
			
		ИначеЕсли ЗначениеЗаполнено(ОбъектИлиЗначенияЧастей.бг_ОсновноеНаименование) Тогда
			ОсновноеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектИлиЗначенияЧастей.бг_ОсновноеНаименование, "Наименование");
			Вариативность = "";
		ИначеЕсли ЗначениеЗаполнено(ОбъектИлиЗначенияЧастей.бг_Вариативность) Тогда
			ОсновноеНаименование = "";
			Вариативность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектИлиЗначенияЧастей.бг_Вариативность, "Наименование");
		Иначе
			ОсновноеНаименование = "";
			Вариативность = "";
		КонецЕсли;
		
		МассивЧастей = Новый Массив;
		
		Если ЗначениеЗаполнено(ОсновноеНаименование) Тогда
			МассивЧастей.Добавить(ОсновноеНаименование + " ");
		Иначе
			МассивЧастей.Добавить("");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектИлиЗначенияЧастей.бг_ГодУрожая) Тогда
			МассивЧастей.Добавить(Формат(ОбъектИлиЗначенияЧастей.бг_ГодУрожая, "ЧГ="));
		Иначе
			МассивЧастей.Добавить("");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектИлиЗначенияЧастей.Крепость) Тогда
			МассивЧастей.Добавить("" + ОбъектИлиЗначенияЧастей.Крепость + "%");
		Иначе
			МассивЧастей.Добавить("");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Вариативность) Тогда
			МассивЧастей.Добавить(Вариативность);
		Иначе
			МассивЧастей.Добавить("");
		КонецЕсли;
		
		Наименование = СтрСоединить(МассивЧастей, "/");
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

&Вместо("ТаблицаНастроекРеквизитов")
Функция бг_ТаблицаНастроекРеквизитов(ВидНоменклатуры,
								ТипНоменклатуры,
								ОсобенностьУчета,
								ИспользованиеХарактеристик,
								ИспользоватьСрокГодностиСерии,
								ВладелецРеквизитов) Экспорт
	

	Таблица = ПродолжитьВызов(ВидНоменклатуры,
								ТипНоменклатуры,
								ОсобенностьУчета,
								ИспользованиеХарактеристик,
								ИспользоватьСрокГодностиСерии,
								ВладелецРеквизитов);								
								
								
	НайденнаяСтрока = Таблица.Найти("бг_УпаковкаПаллета", "ИмяРеквизита");							
	Если НайденнаяСтрока <> Неопределено Тогда
		// Реквизита "бг_УпаковкаПаллета" нет у номенклатуры.
		Таблица.Удалить(НайденнаяСтрока);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция бг_ВыгружаетсяВWMS(ВидНоменклатуры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВариантСинхронизацииWMS = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "бг_ВариантСинхронизацииWMS");
	
	Возврат ЗначениеЗаполнено(ВариантСинхронизацииWMS);

КонецФункции

Функция бг_ШтучнаяУпаковка(Номенклатура) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (УпаковкиЕдиницыИзмерения.Владелец = Номенклатура.Ссылка
	|				И Номенклатура.Ссылка = &Номенклатура
	|				И Номенклатура.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения)
	|ГДЕ
	|	НЕ УпаковкиЕдиницыИзмерения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Упаковка;
	КонецЦикла;

КонецФункции

Функция бг_ПредставлениеТемпературыХранения(ТемператураОт, ТемператураДо, Влажность) Экспорт
	ШаблонТемператураОт = "";
	ШаблонТемператураДо = "";
	ШаблонВлажность = "";
	Если ЗначениеЗаполнено(ТемператураОт) Тогда
		Если ЗначениеЗаполнено(ТемператураДо) Тогда
			ШаблонТемператураОт = СтрШаблон(НСтр("ru = 'От %1°C'"), ТемператураОт);
		Иначе
			ШаблонТемператураОт = СтрШаблон(НСтр("ru = 'Не менее %1°C'"), ТемператураОт);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТемператураДо) Тогда
		Если ЗначениеЗаполнено(ТемператураОт) Тогда
			ШаблонТемператураДо = СтрШаблон(НСтр("ru = 'до %1°C'"), ТемператураДо);
		Иначе
			ШаблонТемператураДо = СтрШаблон(НСтр("ru = 'Не более %1°C'"), ТемператураДо);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Влажность) Тогда
		ШаблонВлажность = СтрШаблон(НСтр("ru = ', при относительной влажности %1%2'"), Влажность, "%");
	КонецЕсли;
	ПредставлениеТемпературыХранения = СтрШаблон("%1 %2%3", 
			ШаблонТемператураОт, ШаблонТемператураДо, ШаблонВлажность);
	Возврат СокрЛП(СтрЗаменить(ПредставлениеТемпературыХранения, "  ", " "));
	
КонецФункции

#КонецОбласти
